[
  {
      "Club": "Arsenal",
      "Overview": "Based in North London, Arsenal are one of the most successful clubs in the history of English football. Arsenal have won 13 league titles, 14 FA Cups (a record), and multiple European honors. The club became world-renowned under Arsène Wenger, particularly during the 2003-04 Invincible season, when they went unbeaten in the Premier League. After a spell away from challenging at the very top of the Premier League, Arsenal have seen a major upturn in fortunes in the last three seasons under current manager (and former player) Mikel Arteta, coming very close to winning the Premier League in 2023 and 2024.  ",
      "History": "Founded in 1886, the club was formed by workers at a weapons manufacturing plant known as The Royal Arsenal, hence the club’s name. Arsenal were the first team from the south of England to join the Football League in 1893 and are the most successful London team in terms of trophies won. Arsenal’s early dominance began in the 1930s under legendary manager Herbert Chapman, who introduced revolutionary tactics that led to five league titles. Following further post-war success, the club stagnated until George Graham took over as manager in the late 1980s, which brought defensive solidity and trophies. However, it was under legendary French manager Arsène Wenger (1996-2018) that Arsenal became a global powerhouse, winning three Premier League titles, including the 2003-04 Invincibles season in which they won the league title without losing a single game, and seven FA Cups. The club moved to the Emirates Stadium in 2006 which led to financial constraints, and the club suffered a trophy drought in the final years of Wenger’s tenure. In recent years, current manager Mikel Arteta has revitalized the squad, blending youth and experience, and Arsenal are now competing at the highest level again.",
      "Stadium": "Arsenal played at Highbury for nearly a century before moving to the Emirates Stadium in 2006, a modern 60,704-seater venue. While initially criticized for lacking Highbury’s intimate atmosphere, it has become a fortress under Arteta. The stadium provides a financial boost that helps Arsenal compete with Europe’s elite.",
      "Rivals": "Arsenal’s fiercest rivalry is with close neighbours Tottenham Hotspur in the North London Derby. They also share intense rivalries with Manchester United (from their title battles in the 1990s and 2000s) and Chelsea (due to London dominance).",
      "Manager": "Mikel Arteta, a former Arsenal captain as a player, has transformed the club with tactical discipline, defensive organization, and attacking creativity. He won the FA Cup in 2020 and has guided Arsenal back to title contention."
  },
  {
      "Club": "Aston Villa",
      "Overview": "Aston Villa, based in Birmingham in the West Midlands, are one of England’s oldest and most decorated clubs, boasting seven league titles, seven FA Cups, and a European Cup (1982). A founding member of the Football League (1888), Villa enjoyed dominance in the early years of English football but experienced inconsistency in modern times. Since hiring current manager Unai Emery, Villa have resurged, competing for Champions League qualification for the first time in decades.",
      "History": "Aston Villa were founded by members of the Villa Cross Wesleyan Church in 1874 in Handsworth, now part of Birmingham. They became a founding member of the Football League in 1888 and Villa were one of the most dominant teams of the very early days of English football, winning six league titles by 1910. A long period of decline and mediocrity followed, culminating in relegation to the third tier for the first time in their history in 1970. Under legendary manager Ron Saunders, Villa climbed back to the first tier and won their seventh league title in 1981. Despite Saunders resigning as manager halfway through the following season, Villa still achieved their greatest triumph when they defeated Bayern Munich 1-0 to win the European Cup in 1982. After a long spell in the top flight without challenging for further league titles, financial struggles and poor management led to relegation from the Premier League in 2016. Since returning in 2019, Villa have become a force again under current manager Unai Emery, with ambitions of breaking into the league’s top four.",
      "Stadium": "Villa Park, their home since 1897, is a historic 42,640-seater stadium that has hosted FA Cup semi-finals and England internationals. Expansion plans are underway to modernize the venue.",
      "Rivals": "Aston Villa’s biggest rivalry is with Birmingham City, the other major club in Birmingham, and games between the two are known as the Second City Derby. They also have historic rivalries with West Bromwich Albion and Wolverhampton Wanderers.",
      "Manager": "Unai Emery, a four-time Europa League-winning manager, has transformed Villa with his tactical expertise, leading them to European qualification."
  },
  {
      "Club": "Bournemouth",
      "Overview": "AFC Bournemouth, based in Bournemouth on the south coast of England, have one of English football’s most remarkable rags-to-riches stories. A club that almost went bankrupt in 2008 defied the odds to reach the Premier League in 2015 under manager Eddie Howe. After relegation in 2020, they returned in 2022 and are now focused on long-term Premier League survival under Andoni Iraola.",
      "History": "Bournemouth were founded in 1899 out of the remains of an existing club, Boscombe St. Johns Institute, after it had disbanded. The club were originally known as Boscombe, then Bournemouth & Boscombe Athletic, and changed to AFC Bournemouth in 1971. Bournemouth have spent almost all of their history in the lower leagues. They retain the record for the most consecutive seasons spent in the third tier, and until 2014 the club’s highest ever finishing position was 12th place in the second tier. They almost dropped out of the Football League altogether in 2008 after financial problems led to a points deduction that very nearly saw Bournemouth relegated from the fourth tier. However, after just surviving the threat of relegation, manager Eddie Howe oversaw a miraculous climb as the club won four promotions in just six years to reach the Premier League for the first time in their history. In their first stint in the Premier League (2015-2020), The Cherries impressed with an attacking brand of football before suffering relegation. Now back in the Premier League, Bournemouth are aiming to push on under new manager Andoni Iraola.",
      "Stadium": "Bournemouth’s Vitality Stadium (formerly Dean Court) is the smallest stadium in the Premier League, with a capacity of just 11,329. Bournemouth have played their home games at Dean Court since 1910.",
      "Rivals": "Bournemouth’s main rivals in the Premier League are Southampton. As Bournemouth have spent the majority of their history outside of the top flight, and because the club is geographically quite far from other teams, they have fewer traditional rivalries than many other clubs.",
      "Manager": "Andoni Iraola, a Spanish coach known for high-pressing, attacking football, was appointed in 2023 and aims to secure Premier League stability."
  },
  {
      "Club": "Brentford",
      "Overview": "Brentford, based in West London, have grown into a competitive Premier League side despite their relatively modest stature and budget. After spending the majorty of their history in the lower leagues, Brentford were promoted to the Premier League in 2021. Since then, they have impressed with a data-driven recruitment model and an attacking playing style. Under current manager Thomas Frank, Brentford are aiming to solidify themselves as a top-half Premier League team.",
      "History": "Brentford were founded in 1889 by members of existing rowing and cricket clubs in the town of Brentford. The club had immediate success whilst playing in London leagues around the turn of the 20th century and joined the Football League in 1920. Until their recent success, Brentford’s high-water mark had been a five-season stay in the first tier either side of WWII, during which time they achieved their highest ever league finish of 5th place. The club have spent the majority of their postwar history in the third tier of English football, bouncing around between the fourth and second tiers on multiple occasions. Owner Matthew Benham is credited with sparking a revival in Brentford’s fortunes following his gradual takeover in the late 2000s and early 2010s. Benham introduced a famously data-driven approach to football, which has led to Brentford consistently outperforming expectations. Having been in League Two as recently as 2010, Brentford won promotion to the Premier League in 2021. They have since become known for intelligent recruitment and tactical adaptability.",
      "Stadium": "Brentford moved from Griffin Park to the Gtech Community Stadium in 2020, a 17,250-capacity modern ground. Despite its small size, the atmosphere remains one of the best in the league.",
      "Rivals": "Brentford’s biggest rivalries are with fellow West London clubs Fulham and Queens Park Rangers (QPR). An emerging rivalry with Chelsea, another West London-based club, has also developed since Brentford’s promotion to the Premier League.",
      "Manager": "Danish manager Thomas Frank, who took over in 2018, has guided Brentford to promotion and stability in the Premier League, emphasizing pressing and quick transitions."
  },
  {
      "Club": "Brighton & Hove Albion",
      "Overview": "Brighton & Hove Albion, based in Brighton on England’s South Coast, have undergone a massive transformation in the 21st century. After being on the brink of financial ruin and relegation out of the Football League in 1997, Brighton have embarked on a rapid rise through the leagues.  They reached the Premier League in 2017 and have quickly developed into one of the most entertaining teams in the division. Their rise has been fueled by smart player recruitment, a possession-based style of play, and an emphasis on youth development. Brighton have now competed for European places under successive managers.",
      "History": "Brighton & Hove Albion were founded in 1901 after the collapse of an earlier attempt to create a football club in the twin towns of Brighton and Hove. Brighton have spent almost their entire history in the lower leagues; other than their current run in the Premier League, their only other spell in the top flight was from 1979-1983. Throughout the 20th century, the club largely bounced around the lower divisions, mostly between the second and third tiers, while the club’s only major trophy came in 1910. By 1997 Brighton were on the brink of financial ruin after large debts crippled the club (the debt was so large that, in an effort to pay off some of the money owed, Brighton even sold their stadium). They barely avoided relegation from the Football League altogether on the final day of the season in 1997, after which they steadily rebuilt and reached the Championship in 2011. After several promotion near misses, Brighton finally reached the Premier League in 2017 and have quickly become a mainstay of the top tier. Becoming known for their attractive, possession-based style of play, Brighton have continued to improve, finishing sixth in 2023 and qualifying for Europe for the first time.",
      "Stadium": "Brighton moved to the Amex Stadium in 2011, a 31,800-seater venue that replaced their old home at the Withdean Stadium. Form 1902 to 1997 Brighton played at the Goldstone Ground, which was sold by the club’s directors in an attempt to pay off the club’s debt. They temporarily moved to the Withdean, an athletics track converted for football, in 1999 before their permanent move to the Amex.",
      "Rivals": "Brighton’s biggest rivalry is with Crystal Palace. Despite the two teams being almost 40 miles apart, the rivalry stems from hostility between the two teams in the 1970s. Brighton are relatively geographically isolated from other teams, meaning they have fewer traditional rivalries than most other clubs.",
      "Manager": "Brighton appointed German coach Fabian Hurzeler as manager at the start of the 2024-25 season, making Hurzeler the youngest manager in Premier League history at 31 years old."
  },
  {
      "Club": "Chelsea",
      "Overview": "Chelsea, based in West London, are one of the biggest and most successful clubs of the past 25 years. A regular in the top flight throughout the 20th century, Chelsea struggled to turn that consistent presence into major honours. That all changed when Roman Abramovich bought the club in 2003; since then, Chelsea have won five Premier League titles, five FA Cups, and two Champions League trophies. Their recent era has been defined by frequent managerial changes, but with new ownership under Todd Boehly, Chelsea are undergoing a rebuild with a focus on young talent.",
      "History": "Chelsea were founded in 1905 when local businessman Gus Mears attempted to lease his athletics stadium to the existing Fulham Football Club. After Fulham turned him down, Mears instead founded his own club, Chelsea. Chelsea were a very well supported cub from their very earliest years. Despite being a regular in the first tier of English football throughout the 20th century, the club ultimately did not find much success in terms of trophies. Until the late 1990s, Chelsea had won just five trophies in their history and suffered severe financial problems in the 1980s. The ‘90s saw a strong rebound as Chelsea began to challenge the upper echelons of English football, but it wasn’t until the mid 2000s that they achieved consistent dominance.  Russian billionaire Roman Abramovich bought the club in 2003 and oversaw a period of extensive spending and resulting success. Legendary manager José Mourinho’s arrival in 2004 saw Chelsea win back-to-back Premier League titles (2005, 2006). Further domestic and European success followed, including three further Premier League titles and two Champions League wins. Following Abramovich’s departure in 2022, Chelsea have gone through an expensive rebuild, focusing on young, high-potential players under new owner, American businessman Todd Boehly.",
      "Stadium": "Chelsea’s home is Stamford Bridge, a 41,837-seater stadium located in Fulham, West London. Stamford Bridge has been Chelsea’s home since their founding in 1905, although plans for a potential new stadium have been mooted for a long time.",
      "Rivals": "Chelsea’s fiercest rivals are Arsenal and Tottenham due to their battles for London supremacy. Their rivalry with Manchester United intensified during the 2000s when both clubs fought for dominance. Despite being in close proximity to other West London clubs like Fulham and Brentford, the rivalries are far less intense than those with Arsenal and Tottenham.",
      "Manager": "Italian coach Enzo Maresca was appointed as Chelsea manager in the summer of 2024, the fourth permanent manger since 2022."
  },
  {
      "Club": "Crystal Palace",
      "Overview": "Crystal Palace, based in Croydon in South London, are a club known for their passionate fanbase and, in recent years, mid-table Premier League stability. Palace have been a solid mid-table Premier League team in recent years after spending the majority of their history in the second and third tiers. Despite not being among the traditional football powerhouses, Crystal Palace’s Selhurst Park stadium is known for having one of the very best atmospheres in the country.",
      "History": "Crystal Palace were founded in 1905 in South London, named after the famous exhibition hall of the same name built for the Great Exhibition in 1851. Up until the 1960s, Crystal Palace played almost exclusively in the third tier, unable to find significant success. Beginning in 1960, Palace began to work their way up the divisions, culminating in their first ever promotion to the top flight in 1969. After relegation back to the second tier in 1973, Palace became something of a yo-yo club as they bounced between the first, second, and third tiers repeatedly. Their best finish came in 1990-91 (third place), and they reached the FA Cup final twice (1990, 2016), losing both times to Manchester United. After years of instability, Palace have remained in the Premier League since 2013, their longest ever run in the first tier. In their most recent stint in the Premier League, Palace have developed a reputation as a fun, dynamic team capable of producing great results even against the top teams, particularly at their Selhurst Park home. Key to that success is the strength of their home support as Selhurst Park is famous for creating some of the loudest and most intimidating atmospheres in the country.",
      "Stadium": "Palace play at Selhurst Park, a 25,486-capacity stadium known for its electric atmosphere, especially in the Holmesdale Stand. There are plans to expand the Main Stand to increase capacity.",
      "Rivals": "Although the two teams are almost 40 miles apart, Palace’s main rivalry is with Brighton & Hove Albion, stemming from heated encounters in the 1970s. They also have local rivalries with fellow South London clubs Charlton Athletic and Millwall, although games between Palace and these local rivals have been rare in recent years as neither club has been in the Premier League in some time."
  },
  {
      "Club": "Everton",
      "Overview": "Everton, based in Liverpool in the North West of England, are one of England’s most historic clubs, with nine league titles and five FA Cups to their name. Once a dominant force of English football, Everton have been beset by financial mismanagement and ownership changes, fighting to escape relegation in recent seasons. Despite this, they boast one of the most passionate fanbases in English football and are on the verge of moving to a brand-new stadium.",
      "History": "Everton were founded by members of the congregation of St. Domingo Church in 1878, with the team originally called St. Domingo’s. The name was changed to Everton a year later to allow people from outside the congregation to participate, and they quickly established themselves as one of the top clubs in the country. Everton won their first league title in 1891 and remained a powerhouse in the pre-WWII era of English football. By the time of the outbreak of WWII, Everton had won five league titles, a total only bettered by Aston Villa and Sunderland. After a long period of decline, Everton saw their most successful era under legendary manager Howard Kendall in the 1980s. The club won two league titles (in 1985 and 1987) and were a fixture at the very top of English football throughout the decade. Since that golden era, Everton have remained an ever-present in the top flight but have failed to recapture that past glory. Since their last trophy win in 1995, their highest league finish is 4th place in 2005, and recent seasons have been turbulent. Ownership changes have contributed to instability on and off the pitch with near relegations in recent seasons. Given their history, Everton are a club of huge stature whose fans are hoping for a reversal in recent fortunes.",
      "Stadium": "Everton’s home is Goodison Park, a 39,572-seater stadium that has been their home since 1892 and is one of the most historic stadiums in English football. They are set to move to a new stadium at Bramley-Moore Dock in 2025, which will hold over 52,000 fans.",
      "Rivals": "Everton’s biggest rival are Liverpool, with matches between the two known as The Merseyside Derby. The two teams’ stadiums are located just over half a mile apart and their storied histories make this one of the most famous games in English football.",
      "Manager": "Everton appointed David Moyes as manger in January 2025. Moyes, an experienced Scottish coach, was previously Everton manager from 2002-2013 and guided them to their most successful period in recent times."
  },
  {
      "Club": "Fulham",
      "Overview": "Fulham, based in the eponymous area of West London, are London’s oldest professional football club. After spending much of the 20th century in the second and third tiers, Fulham have become something of a yo-yo club since the late 90s. Despite frequent promotions and relegations to and from the Premier League, under current manager Marco Silva they have become a mid-table force.",
      "History": "Fulham were founded in 1879 by members of a congregation of a church in Fulham, a neighborhood of West London, making them London’s oldest professional football club. Despite their historical roots, the club did not meet with a great deal of success for the majority of their history. Other than a 9-year spell in the top flight in the 1960s, Fulham spent the 20th century playing in the second and third tiers, with a runner-up finish in the 1975 FA Cup the club’s only notable top-level success. Fortunes began to change at the turn of the century, though; they reached the Premier League in 2001 and would remain there for over a decade, cementing themselves as a stable mid-table team.  During this period they also achieved arguably their greatest success when they reached the 2010 Europa League final, beating some European giants along the way. After bouncing between the Premier League and Championship for four straight seasons, Fulham have stuck in the Premier League after promotion in 2022. Under current manager Marco Silva, they have progressed to become an entertaining side pushing for European places.",
      "Stadium": "Fulham play at Craven Cottage, a 19,000-capacity stadium famous for its picturesque location on the banks of the River Thames and the oldest stand in the Football League.",
      "Rivals": "Fulham’s main rivals are fellow West London clubs Chelsea and Brentford.",
      "Manager": "Marco Silva, known for his attacking philosophy, has transformed Fulham into an entertaining, competitive team."
  },
  {
      "Club": "Ipswich Town",
      "Overview": "Ipswich Town, from Ipswich in the east of England, are a club whose stature outweighs the relatively small town in which they are based. While they have spent much of their recent past in the lower divisions, they remain one of the most historically significant clubs outside of England’s traditional powerhouses. With two major trophies to their name and having been managed by two of England’s greatest ever managers, Ipswich have a strong legacy but have endured a long absence from the top flight until their recent resurgence under current manager Kieran McKenna.",
      "History": "Ipswich were founded in 1878 as Ipswich AFC, later becoming Ipswich Town after merging with Ipswich Rugby Club. After playing in the Southern Amateur League for the first sixty years of their existence, Ipswich joined the Football League in 1938, originally in the third tier. The club initially struggled to escape the third tier, but their fortunes changed dramatically under the stewardship of legendary manager Sir Alf Ramsey. Ramsey would go on to manage England to World Cup glory in 1966, but before achieving that immortal success he led Ipswich from the third tier to the top flight. Even more remarkably, Ramsey’s Ipswich won the league title in their first season in the first tier, 1962. Later, another future England manager, Sir Bobby Robson, built his own legendary Ipswich team, leading the club to FA Cup glory in 1978 and a UEFA Cup triumph in 1981. Following his departure, Ipswich struggled to maintain top-flight status and spent the 1990s and early 2000s oscillating between the Premier League and the second tier. Further struggles led to several years in the third tier, but Ipswich secured back-to-back promotions under current manager Kieran McKenna in 2023 and 2024, returning to the Premier League for the first time in 22 years. Lifelong Ipswich fan Ed Sheeran is a minority owner of the club having grown up very close to Ipswich and his tour has been the club’s main kit sponsor for the last few years.",
      "Stadium": "Ipswich play at Portman Road, their home since 1884, a 29,000-seater stadium known for its traditional English football atmosphere. The stadium has seen many memorable European nights, especially during their UEFA Cup-winning run in the early 1980s.",
      "Rivals": "Ipswich’s fiercest rivalry is with Norwich City, in the East Anglian Derby. This rivalry, one of the fiercest outside the traditional Premier League powerhouses, is rooted in their geographical proximity and longstanding competition for East Anglia’s footballing dominance.",
      "Manager": "Kieran McKenna, a highly regarded young tactician in his first managerial role with Ipswich, has impressed with his progressive attacking football, guiding Ipswich to a remarkable rise from League 1 to the Premier League."
  },
  {
      "Club": "Leicester City",
      "Overview": "Leicester City, based in Leicester in the East Midlands, are best known for their extraordinary 2015-16 Premier League title win, one of the greatest sporting achievements of all time. Historically a mid-table or lower league club, Leicester shocked the football world with their title triumph and continued to compete for European spots in the years that followed. Financial missteps and poor performances led to relegation from the Premier League in 2023, though they immediately returned to the top flight, aiming to rebuild and cement themselves as Premier League regulars once again.",
      "History": "Leicester City were founded in 1884 as Leicester Fosse, so named because the team played on a field by Fosse Road. Other than a 9-year stay in the top flight from 1925-1934, Leicester (renamed Leicester City in 1919) spent most of their pre-WWII history in the second tier. There was a marked upturn in performances during the 1960s and Leicester enjoyed their most stable run in the top flight from 1957-1969, during which time they also reached three FA Cup finals (unfortunately losing all three). Leicester would spend the remainder of the 20th century as a fairly consistent yo-yo club, frequently bouncing between the first and second tier but unable to stabilise themselves as a top flight club. The club’s fortunes changed dramatically in 2014, when they returned to the Premier League after a decade away. A miraculous escape from relegation in 2015 set the stage for their historic Premier League title win in 2016. Having barely escape relegation the previous season, Leicester had odds of 5000-1 to win the Premier League. No team outside England’s traditional powerhouse clubs had won the title for over 20 years and it was generally considered unthinkable that any team from outside the elite could seriously challenge. Nevertheless, Leicester defied the odds. Manager Claudio Ranieri created a well-drilled team that simply did not stop winning despite predictions that their form would dissipate. They won the title ahead of Arsenal and Tottenham, Leicester’s only league triumph to date, and competed in the Champions League for the first time as a result of that miraculous title win. The club continued to perform well, finishing fifth in 2020 and 2021, winning the FA Cup in 2021, and competing in Europe. However, a turbulent 2022-23 season led to relegation, before an immediate return in 2024.",
      "Stadium": "Leicester play at the King Power Stadium, a 32,000-capacity ground that has hosted memorable European nights and their Premier League title celebrations. They previously played at Filbert Street until 2002, when they moved to their current, more modern stadium.",
      "Rivals": "Leicester’s biggest rivalry is with fellow East Midlands club Nottingham Forest. They also have rivalries with Derby County and Coventry City, although neither have been in the Premier League in recent years.",
      "Manager": "Dutch coach Ruud Van Nistelrooy was appointed as Leicester manager in November 2024. Van Nistelrooy has previously managed PSV in The Netherlands and he is tasked with keeping Leicester in the Premier League this season."
  },
  {
      "Club": "Liverpool",
      "Overview": "Alongside arch rival Manchester United, Liverpool are one of the two most successful clubs in the history of English football and one of the most recognisable teams in the world. With 19 league titles, 6 European Cups/Champions League titles, and numerous domestic trophies, Liverpool have a rich history of success. Under recent manager Jürgen Klopp, Liverpool returned to the pinnacle of world football, winning the 2019 Champions League and their first Premier League title in 30 years in 2020. With their recent return to the very top of the game, Liverpool’s blend of history and current success is unmatched by any other club in England.",
      "History": "Liverpool, based in the city of Liverpool in the North West of England, were founded in 1892 by John Houlding after a dispute between Houlding and Everton Football Club, the other major football team in the city. Liverpool quickly rose to prominence as they won their first league title in 1901 and had won four titles by 1923. After a period of relatively little success, the 1970s and 80s saw Liverpool produce one of the most dominant periods in the history of English football. Under successive managers Bill Shankly, Bob Paisley, Joe Fagan, and Kenny Dalglish, the club won 11 league titles and 4 European Cups between 1972 and 1990. This success was also tinged with tragedy, as Liverpool fans were twice the victim of stadium collapses in 1985 and 1989 that killed dozens of fans, events that are etched into the fabric of the club. After their league title in 1990, Liverpool endured a period of relative struggle in the 1990s and 2000s. The arrival of manager Jürgen Klopp in 2015 transformed the club, leading to Champions League (2019) and Premier League (2020) success, re-establishing Liverpool as a dominant force. After Klopp’s resignation in 2024, Liverpool have continued to be one of the best teams in the world as they seek to recapture the Premier League title.",
      "Stadium": "Liverpool’s home is the historic Anfield, with a capacity of 61,000 following recent expansions. Originally built in 1884, Anfield’s most famous feature is the Kop stand, known for its intimidating atmosphere.",
      "Rivals": "Liverpool’s fiercest rivalry is with Manchester United, based on historical rivalry between the two cities dating back to the Industrial Revolution and the success of the two clubs. The Merseyside Derby with Everton is another intense fixture, while their modern rivalry with Manchester City has defined recent title races.",
      "Manager": "Dutch coach Arne Slot is Liverpool’s manager having taken over from Jurgen Klopp in June 2024. Slot is known for his possession-based and intense style of play, which has brought great success during previous stints managing in The Netherlands."
  },
  {
      "Club": "Manchester City",
      "Overview": "Manchester City, based in Manchester in the North West of England, have become the dominant force in English football over the last decade. Once overshadowed by neighbours Manchester United, City’s fortunes changed dramatically after Sheikh Mansour’s takeover in 2008. Under current manager Pep Guardiola, they have won five Premier League titles in six seasons and secured the historic treble (Premier League, FA Cup, and Champions League) in 2023. Despite modest success throughout their history, Manchester City have undoubtedly been the defining team of English football in the last 15 years.",
      "History": "Manchester City were founded in 1880 as St. Mark’s, named after the church of its founding members (later becoming Manchester City in 1894).  City were a very consistent presence in the top flight from their founding until the 1980s, albeit without widescale success. The club did win league titles in 1937 and 1968 but struggled to become a consistent force at the top of the game. After a period of relative success in the 1960s and 70s, City’s fortunes deteriorated throughout the 1980s and 90s and culminated in relegation to the third tier in 1998. The club changed dramatically in 2008 when Sheikh Mansour, a member of the Abu Dhabi Royal Family, purchased the club. A period of large spending followed and in 2012 City won their first league title in 44 years. In 2016, Manchester City appointed former Barcelona and Bayern Munich coach Pep Guardiola as manager. Regarded as one of the greatest managers in the history of world football, Guardiola has led City to a period of utter dominance, winning five of the last 6 Premier League titles and winning the Treble (Premier League, FA Cup, Champions League) in 2023.",
      "Stadium": "City’s home is the Etihad Stadium, a 53,000-seater that was originally built for the 2002 Commonwealth Games. They moved from historic stadium Maine Road in 2003, and the Etihad has undergone multiple expansions as City’s success has grown.",
      "Rivals": "City’s biggest rivalry is with Manchester United in the Manchester Derby, historically dominated by United until City’s rise in recent years. They have a modern rivalry with Liverpool as the two have been the consistent title challengers over the last decade.",
      "Manager": "Pep Guardiola, considered one of the greatest managers in football history, has revolutionized City with tactical brilliance and total football dominance."
  },
  {
      "Club": "Manchester United",
      "Overview": "Alongside arch rival Liverpool, Manchester United are one of England’s two most successful clubs, with a record 20 league titles and 13 FA Cups. They were dominant throughout the 1990s and 2000s under legendary manager Sir Alex Ferguson, winning 13 Premier League titles and two Champions Leagues. However, since Ferguson’s retirement in 2013, United have struggled to regain their elite status, undergoing frequent managerial changes and inconsistent performances. Manchester United are one of the most iconic clubs in the world despite their recent underperformance and have a long history of entertaining, attacking football and a focus on developing local youth players from their academy.",
      "History": "Manchester United, based in Manchester in the North West of England, were founded by railway workers in 1878 and originally called Newton Heath. After changing the name to Manchester United in 1902, United won their first league title in 1908 but largely struggled in the years before WWII, suffering relegation to the second tier on many occasions. United’s success has come largely during two defined periods under two legendary Scottish managers. The first began in the 1950s under manager Sir Matt Busby. After Busby led the team to consecutive league titles in 1956 and ’57, the club was beset by tragedy; in 1958 a plane carrying the team crashed in Munich, killing eight players. Busby overcame his own injuries and rebuilt the club, winning three further league titles and, most famously, the European Cup in 1968. After 20 years of struggle, manager Sir Alex Ferguson led United to a second, even more successful period of dominance. From 1992 to 2013, United won 13 Premier League titles, two Champions Leagues, and the Treble (Premier League, FA Cup, Champions League) in 1999. For over a decade since Ferguson’s departure, United have struggled mightily. Despite extravagant spending and frequent managerial changes, United have failed to compete with rivals Liverpool and Manchester City.",
      "Stadium": "United’s home is Old Trafford, a 74,310-seater stadium, known as the \"Theatre of Dreams.\" The largest stadium in the Premier League, Old Trafford is an iconic stadium in English football, although plans are afoot to replace it with a new stadium in the coming years.",
      "Rivals": "Manchester United’s fiercest rivalry is with Liverpool, based on historical rivalry between the two cities dating back to the Industrial Revolution and the success of the two clubs. They also have intense rivalries with fellow Manchester club Manchester City (who they play in The Manchester Derby), Leeds United, and Arsenal.",
      "Manager": "Portuguese coach Ruben Amorim was appointed as Manchester United’s manager in November 2024. Amorim built his reputation after achieving great success in Portugal and he is seeking to return United to former glory."
  },
  {
      "Club": "Newcastle United",
      "Overview": "Newcastle United, based in Newcastle in the North East of England, are a club with a rich history and one of the most passionate fan bases in English football. Despite long periods of underachievement, Newcastle remain a sleeping giant with enormous potential. Their recent Saudi-backed takeover in 2021 has reignited hopes of a return to the elite, and they secured Champions League qualification in 2023 for the first time in two decades.",
      "History": "Newcastle United were founded in 1892 when the city’s two existing football teams, Newcastle East End and Newcastle West End, merged. Ever since, there has only been one professional club in the city which has led to Newcastle developing a reputation for being one the best-supported teams in the country. Newcastle quickly became a force in English football, winning three league titles before WWI and a fourth in 1927. After a period of decline in the 1930s, Newcastle won 3 FA Cups in the 1950s but went on to endure a long period of underachievement. Their FA Cup win in 1955 remains the club’s most recent major honour. The 1990s saw a major revival, as manager Kevin Keegan created a ream known as the \"Entertainers\" that came agonisingly close to winning the Premier League in 1995-96. However, years of mismanagement and a lack of investment under former owner Mike Ashley led to a decline and eventually relegation in 2010. Newcastle were transformed in 2021 when the club was bought by Saudi Arabia’s Public Investment Fund who have overseen an upturn in the team’s fortunes.",
      "Stadium": "Newcastle play at St. James’ Park, one of the most iconic stadiums in England, with a capacity of 52,000. Located in the heart of Newcastle, it is famous for its steep stands and one of the most passionate atmospheres in the country.",
      "Rivals": "Newcastle’s fiercest rivalry is with nearby Sunderland, known as the Tyne-Wear Derby, though the clubs have not faced each other in years. They also have rivalries with Middlesbrough, another nearby club, and historically with Manchester United due to their 1990s title battles.",
      "Manager": "Eddie Howe, appointed in 2021, has guided Newcastle’s rapid rise with tactical flexibility, defensive solidity, and an exciting attacking approach, leading them back to the Champions League."
  },
  {
      "Club": "Nottingham Forest",
      "Overview": "Nottingham Forest, based in the East Midlands, are one of England’s most historic clubs, best known for their back-to-back European Cup (Champions League) wins in 1979 and 1980 under manager Brian Clough. After decades of decline, Forest returned to the Premier League in 2022 after a 23-year absence. Having survived relegation scares in their first two seasons back in the top flight, Forest are now aiming to push on towards mid-table and the European places.",
      "History": "Nottingham Forest were founded by a group of shinty players looking to play football in 1865, making them one of the oldest football clubs in the world. They won their first FA Cup in 1898 and were a consistent presence in the top flight before WWI. From the 1920s to the 1970s Forest bounced between the first and second tiers, struggling to sustain their place in the top flight until a run from 1957-1972. Their greatest era came under legendary manager Brian Clough in the late 1970s, as he led them from the Second Division to English and European champions in just a few seasons. Forest won their first and only league title in 1978 and then conquered Europe in 1979 and 1980 as they won the European Cup. However, after Clough’s departure in 1993, Forest fell into a long decline. A string of unsuccessful managerial changes and financial difficulties led to Forest slipping out of the Premier League in 1999 and down to the third tier in 2005 for the first time in 54 years. After spending 23 years outside the Premier League, they secured promotion back to the top flight in 2022. Having just avoided relegation in their first two seasons back in the Premier League, Nottingham Forest are having a brilliant 2024-25 season as they push for a return to Champions League football.",
      "Stadium": "Forest’s home is The City Ground, a 30,000-seater stadium located on the banks of the River Trent. The stadium has been home to the club since 1898, and there are plans to expand and modernize it to accommodate their Premier League ambitions.",
      "Rivals": "Forest’s biggest rivals are Derby County, with the East Midlands Derby being one of the fiercest rivalries in English football. They also have a rivalry with Leicester City, another club based in the East Midlands.",
      "Manager": "Portuguese coach Nuno Espírito Santo took over in December 2023. Nuno has previous Premier League experience and brought defensive stability to a team looking to cement its place in the top flight."
  },
  {
      "Club": "Southampton",
      "Overview": "Southampton, based in Southampton on England’s south coast, have long been a respected club in English football, known for developing world-class talent through its youth academy. While never a consistent top challenger, Southampton have enjoyed memorable cup runs and strong league finishes, with their 2017 EFL Cup final appearance and 2015-16 Europa League campaign standing out in recent years. After relegation in 2023, they bounced back quickly and are seeking to re-establish themselves as a Premier League club.",
      "History": "Southampton were founded in 1885 by members of St. Mary’s Church in Southampton, and the club was originally named St Mary’s YMA. Renamed Southampton FC in 1897, the Saints joined the Football League in 1920 and after being promoted to the second tier in 1922, they remained in the division for 31 years. Southampton built a reputation as a solid top-flight team in the 1970s and 1980s, highlighted by their 1976 FA Cup victory, their only major trophy. In 1984 they achieved their best-ever league finish of second, the highlight of a 27-year-long stay in the top flight from 1978-2005. The 1990s and early 2000s saw them develop a reputation as relegation escape artists, with club legend Matt Le Tissier often single-handedly keeping them in the Premier League. They were finally relegated in 2005, followed by relegation to the third tier four years later. But after back-to-back promotions in 2011 and 2012, Southampton enjoyed a dramatic resurgence including a sixth-place finish in 2016. They were relegated again in 2023 but secured an immediate return in 2024, seeking to re-establish themselves as Premier League regulars.",
      "Stadium": "Southampton moved from The Dell, their beloved but compact stadium, to St Mary’s Stadium in 2001. The 32,000-seater ground is now a modern home that has allowed Southampton to grow commercially and attract bigger crowds.",
      "Rivals": "Southampton’s biggest rivals are close neighbours Portsmouth, with games between the two known as the South Coast Derby. The hostility stems from their naval city rivalry, though their meetings have been rare in recent years due to Portsmouth’s decline.",
      "Manager": "After a poor start to the 2024-25 season, Southampton appointed Croatian coach Ivan Juric as manager in December 2024. Prior to Southampton, Juric has an extensive managerial history in Italy."
  },
  {
      "Club": "Tottenham Hotspur",
      "Overview": "Tottenham Hotspur, also known as Spurs, are one of the most exciting clubs in England, known for their entertaining style of play. Despite being considered one of the “big six” of English football, they have struggled to win major silverware in recent years. After falling short in the 2019 Champions League final, Tottenham have gone through relatively frequent managerial changes as they search for a route to compete with the very top teams in England.",
      "History": "Tottenham Hotspur, based in Tottenham in North London, were founded in 1882 by a group of schoolboys and named after a medieval knight from the local area nicknamed Harry Hotspur. Spurs won the FA Cup in 1901 but became something of a yo-yo club in the interwar years, experiencing two relegations and two promotions between 1920 and 1935.  Tottenham were the first club in the 20th century to win the League and FA Cup double (1961) and this ushered in the club’s golden era under legendary manager Bill Nicholson. Nicholson guided Spurs to eight trophies in his 16 years as manager, including a league title, three FA Cups, and a UEFA Cup. Other than one season in the second tier in 1977-78, Spurs have been an ever-present in the top flight since 1950. Despite this, and despite consistent top-half finishes since the mid-1990s, the club has largely struggled to establish itself as a consistent title challenger. Former manager Mauricio Pochettino took Spurs to their first ever Champions League final in 2019 that ultimately ended in defeat to Liverpool. Since then, the club has failed to push on and current manager Ange Postecoglou is attempting to re-establish Spurs as a Champions League club.",
      "Stadium": "Tottenham’s home is the Tottenham Hotspur Stadium, a modern 62,000-seater venue, opened in 2019 to replace their historic home White Hart Lane. It is regarded as one of the best stadiums in the world, featuring an NFL partnership and a retractable pitch.",
      "Rivals": "Tottenham’s biggest rivalry is with Arsenal, in the North London Derby, one of the most famous rivalries in football. They also have rivalries with fellow London clubs Chelsea and West Ham United.",
      "Manager": "Australian coach Ange Postecoglou took over as manager in 2023. Postecoglou is known for his attacking philosophy and high-intensity style which has led to exciting but inconsistent play."
  },
  {
      "Club": "West Ham United",
      "Overview": "West Ham United, based in East London, are a historic club with a deep connection to English football culture, renowned for their academy that has produced many football legends. Often considered a mid-table team, West Ham have oscillated between relegation battles and European qualification in recent years. Under David Moyes, the club won the UEFA Europa Conference League in 2023, their first major trophy in over 40 years, signaling an ambition to break into the upper tier of English football.",
      "History": "West Ham United, based in the West Ham neighbourhood of East London, were founded in 1895 by employees of Thames Ironworks and Shipbuilding Company and originally called Thames Ironworks. The club became West Ham United in 1900 and their working-class roots remain a key part of the club’s identity (the nicknames “The Hammers” and “The Irons” are still used today with reference to the club’s origin). West Ham have played their entire history in either the first or second tier, although they have never won the league title. Despite that, their greatest period came in the 1960s. The Hammers won the 1964 FA Cup and in 1966, legendary players Bobby Moore (West Ham and England captain), Geoff Hurst, and Martin Pieters led England to World Cup glory. Their places, and by extension West Ham’s, in the pantheon of English football will live on forever. While often in the shadow of London’s biggest clubs, West Ham have enjoyed occasional cup success, winning three FA Cups (1964, 1975, 1980). West Ham have been in the Premier League for all-but three seasons since 1993 and enjoyed their greatest modern triumph in 2023 when they won the UEFA Europa Conference League. With that success behind them, the club are aiming to push on and fight for European places on a consistent basis.",
      "Stadium": "West Ham moved from their historic home, Upton Park, to the London Stadium in 2016, a controversial decision that initially divided fans. The 66,000-seater venue, originally built for the 2012 Olympics, has given West Ham a larger stage, though many supporters still miss former home Upton Park, which was famed for its great atmosphere.",
      "Rivals": "West Ham’s fiercest rivals are Millwall, due to their shared East London working-class roots and historical clashes (Millwall were founded by a rival Ironworks company). They also have significant rivalries with Tottenham and Chelsea based on proximity in London.",
      "Manager": "West Ham appointed former Brighton and Chelsea manager Graham Potter in January 2025. Potter is known for his intricate, possession-based style that he implemented with great success during his time with Brighton."
  },
  {
      "Club": "Wolverhampton Wanderers",
      "Overview": "Based in Wolverhampton in the West Midlands, Wolverhampton Wanderers (or Wolves) are a club with a rich history and one of the most passionate fanbases in the Midlands. They were a dominant force in the 1950s, playing a pioneering role in European football. After years of decline, Wolves experienced a resurgence in the 2010s, establishing themselves as a Premier League mainstay. Despite the recent threat of relegation, they remain a dangerous, well-organized team.",
      "History": "Wolves were founded in 1877 as St Luke’s FC, named after the church school that both of its school-age founders attended at the time. They were later renamed Wolverhampton Wanderers after merging with a local cricket club. Wolves were a successful FA Cup team in their early years, winning the trophy in 1896 and again in 1908. After remaining outside the top flight from 1906 to 1932, Wolves won promotion back to the first tier and came agonisingly close to winning the league title, finishing second in the league on three occasions either side of WWII. This was to be the precursor to the club’s heyday, though, as legendary manager Stan Cullis led the team to three league titles in the 1950s and an FA Cup win in 1960. During this period Wolves were also pioneers in European football, playing high-profile friendlies against foreign clubs that helped inspire the creation of the European Cup (Champions League). However, financial difficulties saw them mired in the lower divisions in the 1980s and 1990s, dropping as low as the fourth tier in 1986. After promotion to the second tier in the early 90s, their 2003 return to the Premier League lasted just one season, but under manager Nuno Espírito Santo they secured a return to the top flight in 2018. Since then, Wolves have established themselves as a dangerous team capable of beating the very best, despite facing the threat of relegeation in the last two years.",
      "Stadium": "Wolves play at Molineux, a historic 31,000-seater stadium that has been their home since 1889. The club has consistently modernized the ground, with plans for future expansion.",
      "Rivals": "Wolves’ biggest rivals are West Bromwich Albion. The two sides play in the Black Country Derby, although West Brom currently find themselves in the Championship. They also have rivalries with Aston Villa and Birmingham City, fellow West Midlands clubs.",
      "Manager": "Wolves appointed Portuguese coach Vitor Pereira in December 2024. Pereira took over with Wolves facing the threat of relegation and is tasked with keeping the club in the Premier League"
  }
]